# PointOnFace Properties

---
The PointOnFace type exposes the following members.
| Name| Description
---|---|---
| UV| The location of the point in the surface's coordinate system.
Top
#### Reference
PointOnFace Class
Autodesk.Revit.DB Namespace